//script

/*#ссылки*/
/*#подключение*/
/*#use strict*/
/*#типы данных*/
/*#строки*/
/*#числа*/
/*#объекты*/
/*#массивы*/
/*#Дата и Время*/
/*#Math*/
/*#преобразование типов*/
/*#побитовые операции*/
/*#тесты*/
/*#JSON*/
/*#таймеры*/
/*#циклы*/
/*#функции*/
/*#операторы*/
/*#console*/
/*#тесты*/
/*#window*/
/*#перехват ошибок*/

//bstprc

/*#случаные числа*/
/*#поиск максимума*/
/*#округление/
/*#строки*/
/*#объекты*/
/*#счетчик*/
/*#декораторы*/
/*#замер скорости*/

//sublime

/*#перенос строк*/