//script

/*#ссылки*/
/*#подключение*/
/*#use strict*/
/*#Дата и Время*/
/*#типы данных*/
/*#символ*/
/*#коллекции*/
/*#строки*/
/*#числа*/
/*#объекты*/
/*#proxy*/
/*#массивы*/
/*#Math*/
/*#операторы*/
/*#побитовые операции*/
/*#циклы*/
/*#функции*/
/*#Promise*/
/*#генераторы*/
/*#модули*/
/*#console*/
/*#тесты*/
/*#window*/
/*#JSON*/
/*#таймеры*/
/*#document*/
/*#nodes*/
/*#Element*/
/*#navigator*/
/*#location*/
/*#screen*/
/*#события*/
/*#формы*/
/*#графические компоненты*/
/*#localStorage*/

//bstprc

/*#случаные числа*/
/*#поиск максимума*/
/*#округление/
/*#строки*/
/*#числа*/
/*#объекты*/
/*#счетчик*/
/*#декораторы*/
/*#замер скорости*/
/*#элементы*/
/*#клавиатура*/
/*#мышь*/
/*#сортировка*/
/*#таймер*/

//sublime

/*#перенос строк*/