//script

/*#ссылки*/
/*#подключение*/
/*#use strict*/

/*#Дата и Время*/
/*#------------Создание------------*/
/*#------------Методы------------*/
/*#------------Установка компонентов даты------------*/
/*#------------Автоисправление------------*/
/*#------------Преобразование к числу------------*/
/*#------------Форматирование и вывод дат------------*/

/*#типы данных*/

/*#символ*/
/*#------------создание символа в реестре------------*/
/*#------------keyFor------------*/
/*#------------Особенность------------*/

/*#коллекции*/
/*#------------Map------------*/
/*#------------Set------------*/
/*#------------WeakMap и WeakSet------------*/

/*#строки*/
/*#------------Специальные символы------------*/
/*#------------Строки-шаблоны------------*/
/*#------------метод raw------------*/

/*#числа*/

/*#объекты*/
/*#------------Создание Объекты------------*/
/*#------------Конструктор------------*/
/*#------------Дескрипторы в примерах------------*/
/*#------------Свойство-функция------------*/
/*#------------Прототип proto------------*/
/*#------------Метод hasOwnProperty------------*/
/*#------------prototype------------*/
/*#------------Свойство constructor------------*/
/*#------------instanceof------------*/
/*#------------Деструктуризация------------*/
/*#------------Вычисляемые свойства------------*/
/*#------------Object.assign------------*/
/*#------------Object.is------------*/
/*#------------Методы объекта------------*/
/*#------------super------------*/
/*#------------Итераторы------------*/

/*#proxy*/
/*#------------get/set------------*/
/*#------------has------------*/
/*#------------deleteProperty------------*/
/*#------------apply------------*/
/*#------------construct------------*/
/*#------------Другие методы------------*/

/*#классы*/
/*#------------Class Expression------------*/
/*#------------Статические свойства------------*/
/*#------------Наследование------------*/

/*#массивы*/
/*#------------Создание------------*/
/*#------------Метод pop------------*/
/*#------------Метод push------------*/
/*#------------Метод shift------------*/
/*#------------Метод unshift------------*/
/*#------------Метод split------------*/
/*#------------Метод join------------*/
/*#------------Метод splice------------*/
/*#------------Метод slice------------*/
/*#------------Метод sort------------*/
/*#------------Метод reverse------------*/
/*#------------Метод concat------------*/
/*#------------Метод indexOf------------*/
/*#------------Метод lastIndexOf------------*/
/*#------------Метод forEach------------*/
/*#------------Метод filter------------*/
/*#------------Метод map------------*/
/*#------------Метод every------------*/
/*#------------Метод some------------*/
/*#------------Метод reduce------------*/
/*#------------Метод reduceRight------------*/
/*#------------Псевдомассив аргументов "arguments"------------*/
/*#------------Метод Array.isArray()------------*/
/*#------------деструктуризация------------*/
/*#------------Оператор «spread»------------*/

/*#Math*/

/*#операторы*/
/*#------------приоритет------------*/
/*#------------switch------------*/
/*#------------Оператор instanceof------------*/

/*#преобразование типов*/
/*#------------Строковое преобразование------------*/
/*#------------Численное преобразование------------*/
/*#------------Логическое преобразование------------*/

/*#побитовые операции*/
/*#------------операции------------*/
/*#------------& (Побитовое И)------------*/
/*#------------^ (Исключающее ИЛИ)------------*/
/*#------------~ (Побитовое НЕ)------------*/
/*#------------<< (Битовый сдвиг влево)------------*/
/*#------------>> (Правый битовый сдвиг, переносящий знак)------------*/
/*#------------>>> (Правый сдвиг с заполнением нулями)------------*/

/*#циклы*/
/*#------------Прерывание цикла: break------------*/
/*#------------Следующая итерация: continue------------*/
/*#------------Метки для break/continue------------*/

/*#функции*/
/*#------------Встроенные функции------------*/
/*#------------Function Expression------------*/
/*#------------Function Declaration------------*/
/*#------------Named Function Expression------------*/
/*#------------[[Scope]]------------*/
/*#------------Свойства функции------------*/
/*#------------модули------------*/
/*#------------Метод call------------*/
/*#------------Метод apply------------*/
/*#------------Метод bind------------*/
/*#------------Карринг------------*/
/*#------------Декоратор------------*/
/*#------------eval------------*/
/*#------------Оператор spread------------*/
/*#------------Деструктуризация в параметрах------------*/
/*#------------Имя «name»------------*/
/*#------------стрелочные функции------------*/

/*#Promise*/
/*#------------Цепочки промисов------------*/
/*#------------Перехват ошибок------------*/
/*#------------Внутренние свойства------------*/
/*#------------Promise.all------------*/
/*#------------Promise.race------------*/
/*#------------Promise.resolve------------*/
/*#------------Promise.reject------------*/

/*#генераторы*/
/*#------------Композиция генераторов------------*/

/*#модули*/
/*#------------export------------*/
/*#------------import------------*/

/*#console*/

/*#тесты*/
/*#------------Исправление спецификации------------*/
/*#------------Уточнение реализации------------*/
/*#------------Вложенный describe------------*/
/*#------------before/after и beforeEach/afterEach------------*/
/*#------------Расширение спецификации------------*/
/*#------------самые востребованные assert-проверки, встроенные в Chai:------------*/

/*#window*/
/*#------------Создать переменную------------*/
/*#------------window.onerror------------*/

/*#JSON*/
/*#------------Метод JSON.parse------------*/
/*#------------метод JSON.stringify------------*/

/*#таймеры*/
/*#------------setTimeout------------*/
/*#------------setInterval------------*/
/*#------------Рекурсивный setTimeout------------*/

/*#перехват ошибок*/
/*#------------Генерация своих ошибок------------*/
/*#------------Оборачивание исключений------------*/
/*#------------Секция finally------------*/

//bstprc

/*#случаные числа*/
/*#поиск максимума*/
/*#округление/
/*#строки*/
/*#объекты*/
/*#счетчик*/
/*#декораторы*/
/*#замер скорости*/

//sublime

/*#перенос строк*/