//script

/*#ссылки*/
/*#подключение*/
/*#use strict*/
/*#Дата и Время*/
/*#типы данных*/
/*#символ*/
/*#коллекции*/
/*#строки*/
/*#числа*/
/*#объекты*/
/*#proxy*/
/*#классы*/
/*#массивы*/
/*#Math*/
/*#операторы*/
/*#преобразование типов*/
/*#побитовые операции*/
/*#циклы*/
/*#функции*/
/*#Promise*/
/*#генераторы*/
/*#модули*/
/*#console*/
/*#тесты*/
/*#window*/
/*#JSON*/
/*#таймеры*/
/*#document*/
/*#nodes*/
/*#Element*/
/*#navigator*/
/*#location*/
/*#screen*/

//bstprc

/*#случаные числа*/
/*#поиск максимума*/
/*#округление/
/*#строки*/
/*#объекты*/
/*#счетчик*/
/*#декораторы*/
/*#замер скорости*/

//sublime

/*#перенос строк*/